УправДом/src/Catalogs/СоставСемьи/СоставСемьи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СоставСемьи</name>
  <attributes>
    <name>СемейныйСтатус</name>
    <type>
      <types>CatalogRef.СемейныйСтатус</types>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВПлатежах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.СоставСемьиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлПечати</name>
    <type>
      <types>CatalogRef.СоставСемьиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлПодписи</name>
    <type>
      <types>CatalogRef.СоставСемьиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЛичныеДокументы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>CatalogRef.ВидыДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КемВыдан</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УправДом/src/Catalogs/СоставСемьи/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс


// Возвращает количество человек, учитываемых в платежах.
//
// Возвращаемое значение:
//  Число - КоличествоЧеловек, учитываемых в платежах.
//
Функция ПолучитьКоличествоЧеловекУчитыватьВПлатежах() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(СоставСемьи.Ссылка) КАК КоличествоЧеловек
		|ИЗ
		|	Справочник.СоставСемьи КАК СоставСемьи
		|ГДЕ
		|	СоставСемьи.УчитыватьВПлатежах = ИСТИНА";

	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
		Возврат Выборка.КоличествоЧеловек;
		
КонецФункции


// Переопределяет настройки печати для объекта.
    //
    // Параметры:
    //  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
    //
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
 	
	Настройки.ПриДобавленииКомандПечати = Истина;
           
КонецПроцедуры


 // Заполняет список команд печати.
    // 
    // Параметры:
    //   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
    //
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
        
		Команда = КомандыПечати.Добавить();		
//		Команда.МенеджерПечати = "Документ.ОплатаГазоснабжения"; //Можно не указывать т.к. Мен-р сам документ.
		Команда.Идентификатор = "ПечатьКарточки";
		Команда.Представление = НСтр("ru = 'Печать карточки'");
//		Команда.ПроверкаПроведенияПередПечатью = Истина;
		Команда.Порядок = 10;  
		
          
КонецПроцедуры


// Формирует печатные формы.
//
// Параметры:
// Массив - МассивОбъектов - ссылки на объекты, которые нужно распечатать;
// Структура - ПараметрыПечати  - дополнительные настройки печати;
// ТаблицаЗначений - КоллекцияПечатныхФорм - сформированные табличные документы (выходной параметр)
// СписокЗначений - ОбъектыПечати - значение - ссылка на объект;
//                                            представление - имя области, в которой был выведен объект (выходной параметр);
// Структура - ПараметрыВывода - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ПечатьКарточки");
	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ТабличныйДокумент = ПечатьКарточки(МассивОбъектов, ОбъектыПечати);
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Печать карточки домочадца'");
	    ПечатнаяФорма.ПолныйПутьКМакету = "Справочник.СоставСемьи.ПФ_MXL_ПечатьКарточки";	    
	КонецЕсли;	
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции


// Печать карточки.
// 
// Параметры:
// Массив - МассивОбъектов - Массив объектов
// СписокЗначений -  ОбъектыПечати - СписокЗначений Объекты печати
// 
// Возвращаемое значение:
// ТабличныйДокумент
//  
Функция ПечатьКарточки(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент();
//	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ПечатьКарточки";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Справочник.СоставСемьи.ПФ_MXL_ПечатьКарточки");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СоставСемьи.Ссылка КАК Ссылка,
		|	СоставСемьи.Код КАК Код,
		|	СоставСемьи.Наименование КАК ПолноеИмя,
		|	СоставСемьи.СемейныйСтатус КАК СемейныйСтатус,
		|	СоставСемьи.ДатаРождения КАК ДатаРождения,
		|	СоставСемьи.Пол КАК Пол,
		|	СоставСемьи.УчитыватьВПлатежах КАК УчитыватьВПлатежах,
		|	СоставСемьи.Комментарий КАК Комментарий,
		|	СоставСемьи.ЛичныеДокументы.(
		|		НомерСтроки КАК НомерСтроки,
		|		Документ КАК Документ,
		|		Серия КАК Серия,
		|		Номер КАК Номер,
		|		ДатаВыдачи КАК ДатаВыдачи,
		|		КемВыдан КАК КемВыдан) КАК ЛичныеДокументы
		|ИЗ
		|	Справочник.СоставСемьи КАК СоставСемьи
		|ГДЕ
		|	СоставСемьи.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаДокументы = Макет.ПолучитьОбласть("ШапкаДокументы");
	ОбластьСтрокаДокументы = Макет.ПолучитьОбласть("СтрокаДокументы");
	ОбластьКоммент = Макет.ПолучитьОбласть("Коммент");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	СписокПолей = "";
	Для Каждого Колонка Из РезультатЗапроса.Колонки Цикл
		СписокПолей = СписокПолей + ?(СписокПолей = "","",",") + Колонка.Имя;
	КонецЦикла;
	
	ТабличныйДокумент.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	
	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
//	Вывод документа на печать
	
	//Область Шапка
	ДанныеЗаполненияШапка = Новый Структура(СписокПолей);
	ЗаполнитьЗначенияСвойств(ДанныеЗаполненияШапка, Выборка);
	ДанныеЗаполненияШапка.Вставить("ДатаЗаголовок",Формат(ТекущаяДатаСеанса(),"ДЛФ=DD;" ));
	ВозрастПредставление = РаботаСДатамиКлиентСерверУД.РассчитатьВозраст(ДанныеЗаполненияШапка.ДатаРождения);
	ДанныеЗаполненияШапка.Вставить("ВозрастПредставление", ВозрастПредставление);
	ОбластьШапка.Параметры.Заполнить(ДанныеЗаполненияШапка);				
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	//Область ШапкаДокументы		
	ТабличныйДокумент.Вывести(ОбластьШапкаДокументы);
	
	//ОбластьСтрокаДокументы
	РезультатДокументы = Выборка.ЛичныеДокументы;
	СписокПолейСтроки = "";
	Для Каждого Колонка Из РезультатДокументы.Колонки Цикл
		СписокПолейСтроки = СписокПолейСтроки + ?(СписокПолейСтроки = "","",",") + Колонка.Имя;
	КонецЦикла;
	
	ВыборкаДокументы = РезультатДокументы.Выбрать();
	Пока ВыборкаДокументы.Следующий() Цикл
		
		ДанныеЗаполненияСтрока = Новый Структура(СписокПолейСтроки);
		ЗаполнитьЗначенияСвойств(ДанныеЗаполненияСтрока, ВыборкаДокументы);
		ОбластьСтрокаДокументы.Параметры.Заполнить(ДанныеЗаполненияСтрока); 
		ТабличныйДокумент.Вывести(ОбластьСтрокаДокументы);
	КонецЦикла;
		
	//ОбластьКоммент
	Если Не ДанныеЗаполненияШапка.Комментарий = "" Тогда
		
		ОбластьКоммент.Параметры.Заполнить(ДанныеЗаполненияШапка);
		ТабличныйДокумент.Вывести(ОбластьКоммент);
		
	КонецЕсли;
		
	//ОбластьПодвал	
	ДанныеЗаполненияПодвал = Новый Структура;
	ДанныеЗаполненияПодвал.Вставить("Адрес",Константы.Адрес.Получить());
	ОбластьПодвал.Параметры.Заполнить(ДанныеЗаполненияПодвал);
	ТабличныйДокумент.Вывести(ОбластьПодвал);
	
//	Конец Вывода	
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
								НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		
		ВставлятьРазделительСтраниц = Истина;
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции


#КонецОбласти


#КонецЕсли
